


username = input('Введите имя пользователя: ')   #Ввод имени пользователя
title = input('Напишите заголовок заметки: ')   #Ввод заголовка заметки
content = input('Напишите описание заметки: ')  #Описание заметки
status = input('Введите статус заметки "Готово/В работе/В ожидании":')  #Ввод статуса заметки
created_date = input('Введите дату создания заметки "день.месяц.год": ')    #Дата создания заметки
issue_date = input('Введите дату дедлайн  "день.месяц.год": ')    #дата дедлайна
temp_created_date = (created_date[:5])
temp_issue_date =  (issue_date[:5])








